RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_Program
****************************************************************************//**
*
* This function writes an array of data to a single row of flash. Reports success or
* or a reason for failure.
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash. User firmware should not enter the hibernate
* mode until flash Write is complete. The Flash operation is allowed in Sleep and
* Deep-sleep modes. During the Flash operation, the device should not be reset,
* including the XRES pin, a software reset, and watchdog reset sources. Also,
* low-voltage detect circuits should be configured to generate an interrupt instead
* of a reset. Otherwise, portions of flash may undergo unexpected changes.
*
* config configuration of this function.
* This parameter is defined by the cy_stc_flash_programrow_config_t
* in group_flash_srom_config_structure macro.
*
* Returns the status of the Flash operation (see cy_en_flashdrv_status_t).
*
* Note: row or page is same and of the size 512 bytes
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Program(const cy_stc_flash_programrow_config_t* config, cy_en_flash_driver_blocking_t block)
{
    cy_en_flashdrv_status_t status;

    /* Checks if input pointers are not NULL */
    if(config == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Checks if input address are valid */
    if((Cy_Flash_BoundsCheck((uint32_t)config->destAddr) == CY_FLASH_OUT_OF_BOUNDS) || (config->dataAddr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.ProgramRow.arg0.opcode         = (uint32_t)CY_SROM_OP_FLASH_PROGRAM_ROW;
    apiArgs.ProgramRow.arg0.blocking       = (uint32_t)config->blocking;
    apiArgs.ProgramRow.arg0.skipBlankCheck = (uint32_t)config->skipBC;
    apiArgs.ProgramRow.arg1.dataLoc        = (uint32_t)config->dataLoc;
    apiArgs.ProgramRow.arg1.dataSize       = (uint32_t)config->dataSize;
    apiArgs.ProgramRow.arg1.interruptMask  = (uint32_t)config->intrMask;
    apiArgs.ProgramRow.arg2.dstAddr        = (uint32_t)config->destAddr;
    apiArgs.ProgramRow.arg3.srcAddr        = (uint32_t)config->dataAddr;
    /* Call SROM API driver and process response */
    status = Cy_Flash_CallSromApiForFlashWrite(&apiArgs, block);

    if(status == CY_FLASH_DRV_SUCCESS && block == CY_FLASH_DRIVER_NON_BLOCKING)
    {
        g_non_block_context = (uint8_t)(FLASHC_FM_CTL_ECT_STATUS_PGM_WORK_Msk | FLASHC_FM_CTL_ECT_STATUS_PGM_CODE_Msk);
        status = CY_FLASH_DRV_OPERATION_STARTED;
    }
    return status;
}

/*******************************************************************************
* Function Name: Cy_Flash_Checksum
****************************************************************************//**
*
* Returns a checksum value of the specified flash row. supports only blocking
* mode for now.
* rowNum The Checksum is calculated to the flash row.
*
* checksumPtr The pointer to the address where checksum is to be stored
*
* Returns the status of the Flash operation.
*
* Note:row or page is same and of the size 512 bytes
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Checksum(const cy_stc_flash_checksum_config_t *config, uint32_t* checksumPtr)
{
    /* Checks whether the input parameters are valid */
    if (config->rowId >= CY_FLASH_NUMBER_ROWS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 14.3', 1, \
'Checked manually. Intentional  expression will always be true for CAT1C devices.');
    if(CPUSS_FLASH_SIZE >= 4096u)
    {
        apiArgs.CheckSum.arg0.opcode = (uint32_t)CY_SROM_OP_FLASH_CHECKSUM;
        apiArgs.CheckSum.arg0.region = (uint32_t)config->region;
        apiArgs.CheckSum.arg0.whole  = (uint32_t)config->whole;
        apiArgs.CheckSum.arg0.row_id = (uint32_t)config->rowId;
        apiArgs.CheckSum.arg0.bank   = (uint32_t)config->bank;
    }
    else
    {
        apiArgs.CheckSumLessThan4M.arg0.opcode = (uint32_t)CY_SROM_OP_FLASH_CHECKSUM;
        apiArgs.CheckSumLessThan4M.arg0.region = (uint32_t)config->region;
        apiArgs.CheckSumLessThan4M.arg0.whole  = (uint32_t)config->whole;
        apiArgs.CheckSumLessThan4M.arg0.row_id = (uint32_t)config->rowId;
        apiArgs.CheckSumLessThan4M.arg0.bank   = (uint32_t)config->bank;
    }
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 14.3');
    /* Call SROM API with blocking mode */
    un_srom_api_resps_t apiResp = {{ 0UL }};
    cy_en_srom_driver_status_t sromDrvStatus;
    sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
    if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
    {
        return CY_FLASH_DRV_IPC_BUSY;
    }
    else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
    {
        return CY_FLASH_DRV_SROM_API_TIMEOUT;
    }
    else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
    {
        return CY_FLASH_DRV_ERR_UNC;
    }
    else
    {
        /* non-empty terminating "else" statement. */
    }

    /* Process response message from API */
    cy_en_flashdrv_status_t result;
    result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
    if(result == CY_FLASH_DRV_SUCCESS)
    {
        // checksum is in data1 not data0. the the pointer returned is to data0.
        uint32_t data[2];
//        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1','Checked manually. Intentional Non boolean type is interpreted as boolean.');
        Cy_IPC_Drv_ReadDDataValue(Cy_IPC_Drv_GetIpcBaseAddress((uint32_t)CY_IPC_CHAN_SYSCALL), data );
        *checksumPtr = data[1];
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_Flash_CalculateHash_Ext
****************************************************************************//**
*
* Returns a hash value of the specified region of flash. supports only blocking
* mode for now.
* data Start the data address.
*
* numberOfBytes The hash value is calculated for the number of bytes after the
* start data address (0 - 1 byte, 1- 2 bytes etc).
*
* hashPtr The pointer to the address where hash is to be stored
*
* Returns the status of the Flash operation.
*
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_CalculateHash_Ext(const cy_stc_flash_computehash_config_t *config,  uint32_t* hashPtr)
{
    /* Checks whether the input parameters are valid */
    if ((config->startAddr == NULL) || (config->numOfByte == 0UL) || (hashPtr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.ComputeHash.arg0.opcode      = (uint32_t)CY_SROM_OP_FLASH_HASH;
    apiArgs.ComputeHash.arg0.type        = (uint32_t)config->type;
    apiArgs.ComputeHash.arg1.start_addr  = (uint32_t)config->startAddr;
    apiArgs.ComputeHash.arg2.number_byte = (config->numOfByte - 1UL);

    /* Call SROM API with blocking mode */
    un_srom_api_resps_t apiResp = {{ 0UL }};
    cy_en_srom_driver_status_t sromDrvStatus;
    sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
    if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
    {
        return CY_FLASH_DRV_IPC_BUSY;
    }
    else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
    {
        return CY_FLASH_DRV_SROM_API_TIMEOUT;
    }
    else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
    {
        return CY_FLASH_DRV_ERR_UNC;
    }
    else
    {
        /* non-empty terminating "else" statement. */
    }

    /* Process response message from API */
    cy_en_flashdrv_status_t result;
    result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
    if(result == CY_FLASH_DRV_SUCCESS)
    {
        *hashPtr = apiResp.ComputeHash.resp0.hash_crc;
    }
    return result;
}


