RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_WorkBoundsCheck
****************************************************************************//**
*
* Checks if Flash address is out of work region.
*
* address Address to be checked
*
* en_flash_bounds_t
*
*******************************************************************************/
static en_flash_bounds_t Cy_Flash_WorkBoundsCheck(uint32_t address)
{
    cy_en_bankmode_t bankmode = Cy_Flashc_GetWorkBankMode();
    if(bankmode == CY_FLASH_SINGLE_BANK_MODE)
    {
        if(( CY_WFLASH_LG_SBM_TOP <= address) && (address < CY_WFLASH_LG_SBM_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if((CY_WFLASH_SM_SBM_TOP <= address) && (address < CY_WFLASH_SM_SBM_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }
    }
    else
    {
        if(( CY_WFLASH_LG_DBM0_TOP <= address) && (address < CY_WFLASH_LG_DBM0_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if(( CY_WFLASH_SM_DBM0_TOP <= address) && (address < CY_WFLASH_SM_DBM0_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if(( CY_WFLASH_LG_DBM1_TOP <= address) && (address < CY_WFLASH_LG_DBM1_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if(( CY_WFLASH_SM_DBM1_TOP <= address) && (address < CY_WFLASH_SM_DBM1_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }
    }

    return(CY_FLASH_OUT_OF_BOUNDS);
}

/*******************************************************************************
* Function Name: Cy_Flash_MainBoundsCheck
****************************************************************************//**
*
* Returns 1 if Flash address is out of main region, otherwise returns 0.
*
* address Address to be checked
*
* 1 - out of bound, 0 - in flash bounds
*
*******************************************************************************/
static en_flash_bounds_t Cy_Flash_MainBoundsCheck(uint32_t address)
{
    cy_en_bankmode_t bankmode = Cy_Flashc_GetMainBankMode();
    if(bankmode == CY_FLASH_SINGLE_BANK_MODE)
    {
        if(( CY_FLASH_LG_SBM_TOP <= address) && (address < CY_FLASH_LG_SBM_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if(( CY_FLASH_SM_SBM_TOP <= address) && (address < CY_FLASH_SM_SBM_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }
    }
    else
    {
        if(( CY_FLASH_LG_DBM0_TOP <= address) && (address < CY_FLASH_LG_DBM0_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if(( CY_FLASH_SM_DBM0_TOP <= address) && (address < CY_FLASH_SM_DBM0_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if(( CY_FLASH_LG_DBM1_TOP <= address) && (address < CY_FLASH_LG_DBM1_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }

        if(( CY_FLASH_SM_DBM1_TOP <= address) && (address < CY_FLASH_SM_DBM1_END))
        {
            return(CY_FLASH_IN_BOUNDS);
        }
    }

    return(CY_FLASH_OUT_OF_BOUNDS);
}

/*******************************************************************************
* Function Name: Cy_Flash_BoundsCheck
****************************************************************************//**
*
* Returns 1 if Flash address is out of boundary, otherwise returns 0.
*
* flashAddr Address to be checked
*
* 1 - out of bound, 0 - in flash bounds
*
*******************************************************************************/
static en_flash_bounds_t Cy_Flash_BoundsCheck(uint32_t flashAddr)
{
    if(Cy_Flash_WorkBoundsCheck(flashAddr) == CY_FLASH_IN_BOUNDS)
    {
        return(CY_FLASH_IN_BOUNDS);
    }

    if(Cy_Flash_MainBoundsCheck(flashAddr) == CY_FLASH_IN_BOUNDS)
    {
        return(CY_FLASH_IN_BOUNDS);
    }

    return (CY_FLASH_OUT_OF_BOUNDS);
}

/*******************************************************************************
* Function Name: Cy_Flash_ProcessOpcode
****************************************************************************//**
*
* Converts System Call returns to the Flash driver return defines.
*
* opcode The value returned by the System Call.
*
* Flash driver return. cy_en_flashdrv_status_t only support a
*         part of SROM response. please use Cy_Srom_GetApiResponse to
*         get complete status of SROM API.
*
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_ProcessOpcode(uint32_t opcode)
{
    cy_en_flashdrv_status_t retVal;
    cy_en_srom_api_status_t apiStatus;
    apiStatus = Cy_Srom_ConvertRespToStatus(opcode);

    // Process error code
    switch (apiStatus)
    {
    case CY_SROM_STATUS_SUCCESS:
        retVal = CY_FLASH_DRV_SUCCESS;
        break;
    case CY_SROM_STATUS_INVALID:
        retVal = CY_FLASH_DRV_ERR_UNC;
        break;
    case CY_SROM_STATUS_INVALID_PROTECTION:
        retVal = CY_FLASH_DRV_INV_PROT;
        break;
    case CY_SROM_STATUS_INVALID_FM_PL:
        retVal = CY_FLASH_DRV_INVALID_FM_PL;
        break;
    case CY_SROM_STATUS_INVALID_FLASH_ADDR:
        retVal = CY_FLASH_DRV_INVALID_FLASH_ADDR;
        break;
    case CY_SROM_STATUS_NVM_PROTECTED:
        retVal = CY_FLASH_DRV_ROW_PROTECTED;
        break;
    case CY_SROM_STATUS_INVALID_IPC_STRUCT:
        retVal = CY_FLASH_DRV_IPC_BUSY;
        break;
    case CY_SROM_STAUTS_CHECKSUM_NON_ZERO:
        retVal = CY_FLASH_DRV_CHECKSUM_NON_ZERO;
        break;
    case CY_SROM_STATUS_SECTOR_SUSPEND:
        retVal = CY_FLASH_DRV_SECTOR_SUSPEND;
        break;
    case CY_SROM_STATUS_NO_ERASE_SUSPEND:
        retVal = CY_FLASH_DRV_NO_ERASE_SUSPEND;
        break;
    case CY_SROM_STATUS_FLASH_NOT_ERASED:
        retVal = CY_FLASH_DRV_FLASH_NOT_ERASED;
        break;
    case CY_SROM_STATUS_NO_ERASE_ONGOING:
        retVal = CY_FLASH_DRV_NO_ERASE_ONGOING;
        break;
    case CY_SROM_STATUS_ACTIVE_ERASE:
        retVal = CY_FLASH_DRV_ACTIVE_ERASE;
        break;
    case CY_SROM_STAUTS_INVALID_DATA_WIDTH:
        retVal = CY_FLASH_DRV_INVALID_DATA_WIDTH;
        break;
    case CY_SROM_STATUS_FLASH_SAFTEY_ENABLED:
        retVal = CY_FLASH_DRV_FLASH_SAFTEY_ENABLED;
        break;
    case CY_SROM_STATUS_INVALID_SFLASH_ADDR:
        retVal = CY_FLASH_DRV_INVALID_SFLASH_ADDR;
        break;
    case CY_SROM_STATUS_SFLASH_BACKUP_ERASED:
        retVal = CY_FLASH_DRV_SFLASH_BACKUP_ERASED;
        break;
    default:
        retVal = CY_FLASH_DRV_ERR_UNC;
        break;
    }

    return (retVal);
}

