RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_BlankCheck
****************************************************************************//**
*
* This function performs blank check on the addressed work FLASH.
* Reports success or a reason for failure.
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash.
*
* config configuration of this function.
* This parameter is defined by the cy_stc_flash_blankcheck_config_t
* in group_flash_srom_config_structure macro.
*
* Returns the status of the Flash operation (see cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_BlankCheck(const cy_stc_flash_blankcheck_config_t *config, cy_en_flash_driver_blocking_t block)
{
    /* Checks if input pointers are not NULL */
    if (config == NULL)
    {
        return (cy_en_flashdrv_status_t)CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    if(config->numOfWordsToBeChecked == 0UL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    /* Checks if input address are valid */
    if ((Cy_Flash_WorkBoundsCheck((uint32_t)config->addrToBeChecked) == CY_FLASH_OUT_OF_BOUNDS) ||
        (Cy_Flash_WorkBoundsCheck((uint32_t)config->addrToBeChecked + config->numOfWordsToBeChecked*4UL - 1UL) == CY_FLASH_OUT_OF_BOUNDS))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }

    /* Prepares arguments to be passed to SROM API */
    un_srom_api_args_t apiArgs = {{ 0UL }};
    apiArgs.BlankCheck.arg0.opcode = (uint32_t)CY_SROM_OP_FLASH_BLANK_CHECK;
    apiArgs.BlankCheck.arg1.addrToBeChecked = (uint32_t)config->addrToBeChecked;
    apiArgs.BlankCheck.arg2.numOfWordsToBeChecked = (config->numOfWordsToBeChecked - 1UL);

    /* Tries to acquire the IPC structure and pass the arguments to SROM API */
    if(block == CY_FLASH_DRIVER_BLOCKING)
    {
        /* Call SROM API with blocking mode */
        un_srom_api_resps_t apiResp = {{ 0UL }};
        cy_en_srom_driver_status_t sromDrvStatus;
        sromDrvStatus = Cy_Srom_CallApi(&apiArgs, &apiResp);
        if(sromDrvStatus == CY_SROM_DR_IPC_BUSY)
        {
            return CY_FLASH_DRV_IPC_BUSY;
        }
        else if(sromDrvStatus == CY_SROM_DR_TIMEOUT)
        {
            return CY_FLASH_DRV_SROM_API_TIMEOUT;
        }
        else if(sromDrvStatus == CY_SROM_DR_API_UNKNOWN)
        {
            return CY_FLASH_DRV_ERR_UNC;
        }
        else
        {
            /* Process response message from API */
            cy_en_flashdrv_status_t result;
            result = Cy_Flash_ProcessOpcode(apiResp.resp[0]);
            return result;
        }
    }
    else
    {
        g_non_block_context = (uint8_t)FLASHC_FM_CTL_ECT_STATUS_BLANK_CHECK_WORK_Msk;
        /* Send message by IPC */
        cy_en_srom_driver_status_t status = Cy_Srom_CallApi_NonBlock(&apiArgs);
        if (status != CY_SROM_DR_SUCCEEDED)
        {
            /* The IPC structure is already locked by another process */
            return CY_FLASH_DRV_IPC_BUSY;
        }
        return CY_FLASH_DRV_SUCCESS;
    }
}

/*******************************************************************************
* Function Name: Cy_Flashc_InjectECC
****************************************************************************//**
*
* This function enables ECC injection and sets the address where a parity will be injected
* and the parity value.
* Reports success or a reason for failure.
*
* region An indicator which region (Code/Work/Cache) ECC parity will be injected to.
* This parameter is defined by the cy_en_region_t
* in group_flash_macro macro.
*
* address The address where ECC parity will be injected.
*
* parity The parity value which will be injected.
*
* Returns the status of the Flash operation (see cy_en_flashdrv_status_t).
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flashc_InjectECC(cy_en_region_t region, uint32_t address, uint8_t parity)
{
    cy_en_flashdrv_status_t result =CY_FLASH_DRV_SUCCESS;

    switch(region)
    {
    case CY_FLASH_MAIN_REGION:
        if (Cy_Flash_MainBoundsCheck(address) == CY_FLASH_OUT_OF_BOUNDS)
        {
                return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
        }
        FLASHC_FLASH_CTL |= _VAL2FLD(FLASHC_FLASH_CTL_MAIN_ECC_INJ_EN, 1U);
        FLASHC_ECC_CTL = (_VAL2FLD(FLASHC_ECC_CTL_WORD_ADDR, address) |
                         _VAL2FLD(FLASHC_ECC_CTL_PARITY, parity ));
        break;
    case CY_FLASH_WORK_REGION:
        if (Cy_Flash_WorkBoundsCheck(address) == CY_FLASH_OUT_OF_BOUNDS)
        {
            return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
        }
        FLASHC_FLASH_CTL |= _VAL2FLD(FLASHC_FLASH_CTL_WORK_ECC_INJ_EN, 1U);
        FLASHC_ECC_CTL = (_VAL2FLD(FLASHC_ECC_CTL_WORD_ADDR, address) |
                         _VAL2FLD(FLASHC_ECC_CTL_PARITY, parity ));
        break;
    case CY_FLASH_CA_CM0P_REGION:
        if (Cy_Flash_MainBoundsCheck(address) == CY_FLASH_OUT_OF_BOUNDS)
        {
                return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
        }
        FLASHC_FLASH_CTL |= _VAL2FLD(FLASHC_CM0_CA_CTL0_RAM_ECC_INJ_EN, 1U);
        FLASHC_ECC_CTL = (_VAL2FLD(FLASHC_ECC_CTL_WORD_ADDR, address) |
                         _VAL2FLD(FLASHC_ECC_CTL_PARITY, parity ));
        break;
    default:
        // Default case. Nothing to do.
        break;
    }

    return result;
}

/*******************************************************************************
* Function Name: Cy_Flash_OperationStatus
****************************************************************************//**
*
* Checks the status of the Flash Operation, and returns it.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_OperationStatus(void)
{
    un_srom_api_resps_t resp = {{ 0UL }};
    if(0UL != (FLASHC_FM_CTL_ECT_FLASH_STATUS & g_non_block_context))
    {
        return CY_FLASH_DRV_OPERATION_STARTED;
    }
    else
    {
        g_non_block_context = 0;
        cy_en_srom_api_status_t status = Cy_Srom_GetApiResponse(&resp);
        if(CY_SROM_STATUS_SUCCESS == status)
        {
            return Cy_Flash_ProcessOpcode(resp.resp[0]);
        }
        else
        {
            return CY_FLASH_DRV_ERR_UNC;
        }

