RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_ProgramRow
****************************************************************************//**
*
* This function writes an array of data to a single row of flash. Reports
* success or a reason for failure. Does not return until the Program operation
* is complete.
* Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in the case
* when another process is writing to flash. User firmware should not enter the
* Hibernate or Deep-sleep mode until flash Write is complete. The Flash operation
* is allowed in Sleep mode. During the Flash operation, the device should not be
* reset, including the XRES pin, a software reset, and watchdog reset sources.
* Also, low-voltage detect circuits should be configured to generate an interrupt
* instead of a reset. Otherwise, portions of flash may undergo unexpected
* changes.\n
* Before calling this function, the target flash region must be erased by
* the StartErase/EraseRow function.\n
* Data to be programmed must be located in the SRAM memory region.
* \note Before reading data from previously programmed/erased flash rows, the
* user must clear the flash cache with the Cy_SysLib_ClearFlashCacheAndBuffer()
* function.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_ProgramRow(uint32_t rowAddr, const uint32_t* data)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    uint32_t prog_length = (uint32_t)ADDRESS_LENGTH_32_BIT;
    uint32_t data_length = (uint32_t)DATA_LENGTH_32_BIT;

    if (data == NULL)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    cy_stc_flash_programrow_config_t flash_programrow_config =
    {
        .destAddr  =   (const uint32_t *)rowAddr,
        .dataAddr  =   (const uint32_t *)data,
        .blocking  =   CY_FLASH_PROGRAMROW_BLOCKING,
        .skipBC    =   CY_FLASH_PROGRAMROW_SKIP_BLANK_CHECK,
        .dataSize  =   CY_FLASH_PROGRAMROW_DATA_SIZE_32BIT,
        .dataLoc   =   CY_FLASH_PROGRAMROW_DATA_LOCATION_SRAM,
        .intrMask  =   CY_FLASH_PROGRAMROW_NOT_SET_INTR_MASK,
    };
    /* Checks whether the input parameters are valid */
    if(Cy_Flash_WorkBoundsCheck(rowAddr) == CY_FLASH_IN_BOUNDS)
    {
        flash_programrow_config.dataSize = CY_FLASH_PROGRAMROW_DATA_SIZE_32BIT;
    }
    else if(Cy_Flash_MainBoundsCheck(rowAddr) == CY_FLASH_IN_BOUNDS)
    {
        prog_length = ADDRESS_LENGTH_256_BIT;
        data_length = DATA_LENGTH_256_BIT;
        flash_programrow_config.dataSize = CY_FLASH_PROGRAMROW_DATA_SIZE_256BIT;
    }
    else
    {
        /* empty else statement. */
    }
    for(uint32_t i_addr = rowAddr;  i_addr < rowAddr + CY_FLASH_SIZEOF_ROW; i_addr+=prog_length)
    {
        flash_programrow_config.destAddr = (const uint32_t *)i_addr;
        flash_programrow_config.dataAddr = (const uint32_t *)(data);
        result = Cy_Flash_Program(&flash_programrow_config, CY_FLASH_DRIVER_BLOCKING);
        if(result != CY_FLASH_DRV_SUCCESS)
        {
            break;
        }
        data+=data_length;
    }
    return (result);
}

/*******************************************************************************
* Function Name: Cy_Flash_EraseSector
****************************************************************************//**
*
* This function erases a sector of flash. Reports success or
* a reason for failure. Does not return until the Erase operation is
* complete. Returns immediately and reports a \ref CY_FLASH_DRV_IPC_BUSY error in
* the case when another process is writing to flash or erasing the row.
* User firmware should not enter the Hibernate or Deep Sleep mode until flash Erase
* is complete. The Flash operation is allowed in Sleep mode.
* During the Flash operation, the device should not be reset, including the
* XRES pin, a software reset, and watchdog reset sources. Also, low-voltage
* detect circuits should be configured to generate an interrupt instead of a
* reset. Otherwise, portions of flash may undergo unexpected changes.
*
* \param sectorAddr Address of the flash row number.
* The Read-while-Write violation occurs when the flash read operation is
* initiated in the same flash sector where the flash write operation is
* performing. Refer to the device datasheet for the details.
* Address must match row start address.
*
* \return Returns the status of the Flash operation,
* see \ref cy_en_flashdrv_status_t.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_EraseSector(uint32_t sectorAddr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;

    /* Checks whether the input parameters are valid */
    if(Cy_Flash_BoundsCheck((uint32_t)(sectorAddr)) == CY_FLASH_OUT_OF_BOUNDS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    cy_stc_flash_erasesector_config_t flash_erasesector_config =
    {
        .sectorAddr  =  (const uint32_t *)sectorAddr,
        .blocking    =  CY_FLASH_ERASESECTOR_BLOCKING,
        .intrMask    =  CY_FLASH_ERASESECTOR_NOT_SET_INTR_MASK,
    };
    result = Cy_Flash_EraseSector_Ext(&flash_erasesector_config, CY_FLASH_DRIVER_BLOCKING);

    return (result);
}

/*******************************************************************************
* Function Name: Cy_Flash_CalculateHash
****************************************************************************//**
*
* Returns a hash value of the specified region of flash.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_CalculateHash(const uint32_t* data, uint32_t numberOfBytes, uint32_t* hashPtr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;

    /* Checks whether the input parameters are valid */
    if ((data == NULL) || (numberOfBytes == 0UL) || (hashPtr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    cy_stc_flash_computehash_config_t flash_computehash_config =
    {
        .startAddr =  (const uint32_t *)data,
        .numOfByte =  numberOfBytes,
        .type      =  CY_FLASH_COMPUTEHASH_BASIC,
    };
    result = Cy_Flash_CalculateHash_Ext(&flash_computehash_config, hashPtr);

    return (result);
}

