RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_flash_v2.c
/*******************************************************************************
* Function Name: Cy_Flash_RowChecksum
****************************************************************************//**
*
* Returns a checksum value of the specified flash row.
*
* \note Now Cy_Flash_RowChecksum() requires the row <b>address</b> (rowAddr)
*       as a parameter. In previous versions of the driver, this function used
*       the row <b>number</b> (rowNum) for this parameter.
*
* rowAddr The address of the flash row.
*
* checksumPtr The pointer to the address where checksum is to be stored
*
* Returns the status of the Flash operation.
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_RowChecksum(uint32_t rowAddr, uint32_t* checksumPtr)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    uint8_t rowID = 0;
    cy_en_flash_checksum_bank_t bank = CY_FLASH_CHECKSUM_BANK0;
    cy_en_flash_checksum_region_t region = CY_FLASH_CHECKSUM_MAIN;

    /* Checks whether the input parameters are valid */
    if ((Cy_Flash_BoundsCheck(rowAddr)== CY_FLASH_OUT_OF_BOUNDS) || (checksumPtr == NULL))
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    if (CY_FLASH_DRV_SUCCESS == Cy_Flash_GetRowDetails(rowAddr,&rowID, &bank, &region))
    {
        cy_stc_flash_checksum_config_t flash_computechecksum_config =
        {
            .rowId      =  rowID,
            .bank       =  bank,
            .whole      =  CY_FLASH_CHECKSUM_PAGE,
            .region     = region,
        };
        result = Cy_Flash_Checksum(&flash_computechecksum_config, checksumPtr);
    }

    return (result);
}

/*******************************************************************************
* Function Name: Cy_Flash_GetRowDetails
****************************************************************************//**
*
* Returns flash region ID, Bank and row number of the Flash address.
*******************************************************************************/
static cy_en_flashdrv_status_t Cy_Flash_GetRowDetails(uint32_t rowAddr, uint8_t *rowID, cy_en_flash_checksum_bank_t *bank, cy_en_flash_checksum_region_t *region)
{
    cy_en_flashdrv_status_t result = CY_FLASH_DRV_SUCCESS;
    if (Cy_Flash_WorkBoundsCheck(rowAddr) == CY_FLASH_OUT_OF_BOUNDS)
    {
        return CY_FLASH_DRV_INVALID_INPUT_PARAMETERS;
    }
    cy_en_bankmode_t bankmode = Cy_Flashc_GetMainBankMode();
    if(bankmode == CY_FLASH_SINGLE_BANK_MODE)
    {

        if ((rowAddr >= CY_WFLASH_LG_SBM_TOP) && (rowAddr < CY_WFLASH_SM_SBM_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_WFLASH_LG_SBM_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_WORK;
        }
        else if ((rowAddr >= CY_FLASH_LG_SBM_TOP) && (rowAddr < CY_FLASH_SM_SBM_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_WFLASH_LG_SBM_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_MAIN;
        }
        else
        {
            /* rowAddr oout of bounds. */
        }
    }
    else
    {
        if ((rowAddr >= CY_WFLASH_LG_DBM0_TOP) && (rowAddr < CY_WFLASH_SM_DBM0_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_WFLASH_LG_DBM0_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_WORK;
        }
        else if ((rowAddr >= CY_WFLASH_LG_DBM1_TOP) && (rowAddr < CY_WFLASH_SM_DBM1_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_WFLASH << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_WFLASH_LG_SBM_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK1;
            *region = CY_FLASH_CHECKSUM_WORK;
        }
        else if ((rowAddr >= CY_FLASH_LG_DBM0_TOP) && (rowAddr < CY_FLASH_SM_DBM0_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_FLASH_LG_DBM0_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK0;
            *region = CY_FLASH_CHECKSUM_MAIN;
        }
        else if ((rowAddr >= CY_FLASH_LG_DBM1_TOP) && (rowAddr < CY_FLASH_SM_DBM1_END))
        {
            *rowID = (uint8_t)((CY_FLASH_REGION_ID_MAIN << CY_FLASH_REGION_ID_SHIFT) |
                     ((rowAddr - CY_FLASH_LG_DBM1_TOP) / CY_FLASH_SIZEOF_ROW));
            *bank = CY_FLASH_CHECKSUM_BANK1;
            *region = CY_FLASH_CHECKSUM_MAIN;
        }
        else
        {
            /* rowAddr oout of bounds. */
        }

    }

    return (result);
}

/*******************************************************************************
* Function Name: Cy_Flash_Init
****************************************************************************//**
*
* Initiates all needed prerequisites to support flash erase/write.
* Should be called from each core.
*
* This function is called in the SystemInit() function, for proper flash write
* and erase operations. If the default startup file is not used, or the function
* SystemInit() is not called in your project, ensure to perform the following steps
* before any flash or EmEEPROM write/erase operations:
*
*******************************************************************************/
void Cy_Flash_Init(void)
{
    /* In Blocking mode the calling function get's the response and sends it to the user.
     * In Non blocking mode user will call operation status and gets the response in return.
     * There is no need for the driver to handle error in the interrupt handler.
     * Error needs to be passed to the user.
     */
    Cy_Srom_SetResponseHandler(NULL);
}

/*******************************************************************************
* Function Name: Cy_Flash_IsOperationComplete
****************************************************************************//**
*
* Reports a successful operation result, reason of failure or busy status
* ( CY_FLASH_DRV_OPCODE_BUSY ).
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_IsOperationComplete(void)
{
    return (Cy_Flash_OperationStatus());
}


